import socket

def send_packets():
    # Запрашиваем у пользователя количество пакетов, IP-адрес и порт
    target_ip = input("Введите IP-адрес: ")
    target_port = int(input("Введите порт: "))
    packet_count = int(input("Введите количество пакетов для отправки: "))

    # Создаем сокет для отправки данных
    sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)

    # Отправляем пакеты в цикле
    for i in range(packet_count):
        message = f"010101010101010101010@0@0@0@0@0@0101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101836491472073927394626949261830472803476382937392739926393048275283040592716518394059372761527394040298262527494005938271626830505083837262683940505938276252638495004827261537840405948376251618390505837261516839405".encode()  # Сообщение пакета
        sock.sendto(message, (target_ip, target_port))  # Отправка пакета
        print(f"Пакет {i + 1} отправлен на {target_ip}:{target_port}")

    # Закрываем сокет после отправки всех пакетов
    sock.close()

if __name__ == "__main__":
    send_packets()
 
